package com.wenbo.util;


public final class RegularUtil {

    /**
     * 不含有以下特殊字符
     */
    public static final String SPECIAL_CHARACTER = "[^%&~',;=?!@#*$()-+\\x22]+";
    /**
     * 只能是数字
     */
    public static final String ONLY_IS_NUMERAL = "^[0-9]*$";
    /**
     * 端口
     */
    public static final String CHECK_PORT = "([0-9]|[1-9]\\d{1,3}|[1-5]\\d{4}|6[0-4]\\d{3}|65[0-4]\\d{2}|655[0-2]\\d|6553[0-5])";
    /**
     * 域名：以 ".com"、".cn"等等结尾，忽略大小写
     */
    public static final String CHECK_REALM_NAME = "^(?i)[0-9a-zA-Z](.*?)\\.(?i)(com|cn|net|org|biz|info|cc|tv)$";
    /**
     * Web资产（域名）地址
     */
    public static final String WEB_ASSET_ADDR = "https?://(?:([A-Za-z0-9-]+\\.)+(?:\\w{1,64})|(\\d{1,3}\\.){3}\\d{1,3})(\\:\\d{2,5})?(/[A-Za-z0-9_\\-=%#?&!/.]*?)?";
    /**
     * ip或ip段（精确匹配）：<br/>
     * 1.2.3.4<br/>
     * 1.2.3.0/24<br/>
     * 1.2.3.4-24<br/>
     */
    public static final String IP_RANGE = "^(25[0-5]|2[0-4]\\d|[0-1]?\\d?\\d)(\\.(25[0-5]|2[0-4]\\d|[0-1]?\\d?\\d)){3}(?:/([0-9]|[0-2][0-9]|3[0-2])|-(25[0-5]|2[0-4]\\d|[0-1]?\\d?\\d))?$";
    /**
     * ip
     */
    public static final String IP_ASSET_ADDR = "^(1\\d{2}|2[0-4]\\d|25[0-5]|[1-9]\\d|[1-9])(\\.(1\\d{2}|2[0-4]\\d|25[0-5]|[1-9]\\d|\\d)){3}$";
    /**
     * ipv4
     */
    public static final String IPV4_ADDRESS = IP_ASSET_ADDR;
    /**
     * 邮箱
     */
    public static final String EMAIL = "^\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*$";
    /**
     * ip段 172.16.20.11-90
     */
    public static final String IP_SECTION = "(?:\\d{1,3}\\.){3}\\d{1,3}-\\d{1,3}";

    /**
     * ipv6
     */
    public static final String IP_SIX = "^\\s*((([0-9A-Fa-f]{1,4}:){7}([0-9A-Fa-f]{1,4}|:))|(([0-9A-Fa-f]{1,4}:){6}(:[0-9A-Fa-f]{1,4}|((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){5}(((:[0-9A-Fa-f]{1,4}){1,2})|:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){4}(((:[0-9A-Fa-f]{1,4}){1,3})|((:[0-9A-Fa-f]{1,4})?:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){3}(((:[0-9A-Fa-f]{1,4}){1,4})|((:[0-9A-Fa-f]{1,4}){0,2}:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){2}(((:[0-9A-Fa-f]{1,4}){1,5})|((:[0-9A-Fa-f]{1,4}){0,3}:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){1}(((:[0-9A-Fa-f]{1,4}){1,6})|((:[0-9A-Fa-f]{1,4}){0,4}:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3}))|:))|(:(((:[0-9A-Fa-f]{1,4}){1,7})|((:[0-9A-Fa-f]{1,4}){0,5}:((25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)(\\.(25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)){3}))|:)))(%.+)?\\s*$";


    /**
     * 电话号码正则表达式
     */
    public static final String PHONE = "^1[3|4|5|6|7|8|9][0-9]\\d{8}$";

    /**
     * ipv4常见格式（非精确匹配）：<br/>
     * 1.2.3.4<br/>
     * 1.2.3.0/24<br/>
     * 1.2.3.1-24<br/>
     * 1.2.3.1-1.2.3.24<br/>
     */
    public static final String ALL_IPV4_FORMAT = "(\\d{1,3}\\.){3}\\d{1,3}(?:/\\d{1,2}|-\\d{1,3}|-(\\d{1,3}\\.){3}\\d{1,3})?";

    /**
     * web监控可用的http的平稳度
     */
    public static final String HTTP_STATUS = "200|(^30[1-7]$)";

}
